app/views/groups/_form.html.erb

    <%= f.label :postName %><br />
    <%@posts=Post.all%>
---
SELECT "posts".* FROM "posts" ORDER BY name