app/controllers/posts_controller.rb

INSERT INTO "posts" ("address", "created_at", "desire", "dob", "hobby", "interests", "name", "signature", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save